





Network Working Group                                       Luca Martini
Internet Draft                                             Eric C. Rosen
Expiration Date: May 2006                            Cisco Systems, Inc.

Nasser El-Aawar                                              Giles Heron
Level 3 Communications, LLC.                                     Tellabs




                                                           November 2005


   Encapsulation Methods for Transport of Ethernet Over MPLS Networks


                 draft-ietf-pwe3-ethernet-encap-11.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that other
   groups may also distribute working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time. It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/1id-abstracts.html

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

Abstract

   An Ethernet Pseudowire (PW) is used to carry Ethernet/802.3 Protocol
   Data Units over an MPLS network. This enables service providers to
   offer "emulated" Ethernet services over existing MPLS networks. This
   document specifies the encapsulation of Ethernet/802.3 PDUs within a
   pseudo wire. It also specifies the procedures for using a PW to
   provide a "point-to-point Ethernet" service.



Martini, et al.                                                 [Page 1]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005




Table of Contents

    1      Specification of Requirements  ..........................   2
    2      Introduction  ...........................................   3
    3      Applicability Statement  ................................   6
    4      Details Specific to Particular Emulated Services  .......   7
    4.1    Ethernet Tagged Mode  ...................................   7
    4.2    Ethernet Raw Mode  ......................................   8
    4.3    Ethernet Specific Interface Parameter LDP Sub-TLV  ......   8
    4.4    Generic Procedures  .....................................   8
    4.4.1  Raw Mode vs. Tagged Mode  ...............................   9
    4.4.2  MTU Management on the PE/CE Links  ......................  10
    4.4.3  Frame Ordering  .........................................  11
    4.4.4  Frame Error Processing  .................................  11
    4.4.5  IEEE 802.3x Flow Control Interworking  ..................  11
    4.5    Management  .............................................  11
    4.6    The Control Word  .......................................  12
    4.7    QoS Considerations  .....................................  13
    5      Security Considerations  ................................  13
    6      PSN MTU Requirements  ...................................  14
    7      IANA Considerations  ....................................  14
    8      Full Copyright Statement  ...............................  14
    9      Intellectual Property Statement  ........................  14
   10      Normative References  ...................................  15
   11      Informative References  .................................  16
   12      Editor Information  .....................................  16
   13      Author Information  .....................................  16
   14      Significant Contributors  ...............................  17
   Ap A    Interoperability Guidelines  ............................  20
   Ap B    QoS Details  ............................................  21





1. Specification of Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119









Martini, et al.                                                 [Page 2]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


2. Introduction

   An Ethernet Pseudowire (PW) allows Ethernet/802.3 [802.3] Protocol
   Data Units (PDUs) to be carried over an Multi Protocol Label Switched
   [MPLS-ARCH] network. In addressing the issues associated with
   carrying an Ethernet PDU over a Public Switched Network (PSN), this
   document assumes that a Pseudowire (PW) has been set up by using a
   control protocol such as the one as described in [PWE3-CTRL]. The
   design of Ethernet Pseudowire described in this document conforms to
   the pseudo wire architecture described in [RFC3985]. It is also
   assumed in the remainder of this document that the reader is familiar
   with RFC3985.

   The PWE3 Ethernet PDU consists of the Destination Address, Source
   Address, Length/Type, MAC Client Data and padding extracted from a
   MAC frame as a concatenated octet sequence in their original order
   [PDU].

   In addition to the Ethernet PDU format used within the pseudo wire,
   this document discusses:

     - Procedures for using a PW in order to provide a pair of Customer
       Edge Routers (CE) with an emulated (point-to-point) Ethernet
       service, including the procedures for the processing of Provider
       Edge-bound and CE-bound Ethernet PDUs.  [RFC3985]

     - Ethernet-specific QoS and security considerations

     - Inter-domain transport considerations for Ethernet PW

   The following two figures describe the reference models which are
   derived from [RFC3985] to support the Ethernet PW emulated services.



















Martini, et al.                                                 [Page 3]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


         |<-------------- Emulated Service ---------------->|
         |                                                  |
         |          |<------- Pseudo Wire ------>|          |
         |          |                            |          |
         |          |    |<-- PSN Tunnel -->|    |          |
         | PW End   V    V                  V    V  PW End  |
         V Service  +----+                  +----+  Service V
   +-----+    |     | PE1|==================| PE2|     |    +-----+
   |     |----------|............PW1.............|----------|     |
   | CE1 |    |     |    |                  |    |     |    | CE2 |
   |     |----------|............PW2.............|----------|     |
   +-----+  ^ |     |    |==================|    |     | ^  +-----+
         ^  |       +----+                  +----+     | |  ^
         |  |   Provider Edge 1         Provider Edge 2  |  |
         |  |                                            |  |
   Customer |                                            | Customer
   Edge 1   |                                            | Edge 2
            |                                            |
            |                                            |
    Attachment Circuit (AC)                    Attachment Circuit (AC)
    native Ethernet service                    native Ethernet service


      Figure 1: PWE3 Ethernet/VLAN Interface Reference Configuration

   The "emulated service" shown in Figure 1 is, strictly speaking, a
   bridged LAN; the PEs have MAC interfaces, consume MAC control frames,
   etc. However, the procedures specified herein only support the case
   in which there are two CEs on the "emulated LAN". Hence we refer to
   this service as "emulated point-to-point Ethernet". Specification of
   the procedures for using pseudo wires to emulate LANs with more than
   two CEs are out of scope of the current document.

   +-------------+                                +-------------+
   |  Emulated   |                                |  Emulated   |
   |  Ethernet   |                                |  Ethernet   |
   | (including  |         Emulated Service       | (including  |
   |  VLAN)      |<==============================>|  VLAN)      |
   |  Services   |                                |  Services   |
   +-------------+           Pseudo Wire          +-------------+
   |Demultiplexer|<==============================>|Demultiplexor|
   +-------------+                                +-------------+
   |    PSN      |            PSN Tunnel          |    PSN      |
   |   MPLS      |<==============================>|   MPLS      |
   +-------------+                                +-------------+
   |  Physical   |                                |  Physical   |
   +-----+-------+                                +-----+-------+




Martini, et al.                                                 [Page 4]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


      Figure 2: Ethernet PWE3 Protocol Stack Reference Model

   For the purpose of this document, PE1 will be defined as the ingress
   router, and PE2 as the egress router. A layer 2 PDU will be received
   at PE1, encapsulated at PE1, transported, decapsulated at PE2, and
   transmitted out on the attachment circuit of PE2.

   An Ethernet PW emulates a single Ethernet link between exactly two
   endpoints. The mechanisms described in this document are agnostic to
   that which is beneath the "Pseudo Wire" level in Figure 2, concerning
   itself only with the "Emulated Service" portion of the stack.

   The following reference model describes the termination point of each
   end of the PW within the PE:

           +-----------------------------------+
           |                PE                 |
   +---+   +-+  +-----+  +------+  +------+  +-+
   |   |   |P|  |     |  |PW ter|  | PSN  |  |P|
   |   |<==|h|<=| NSP |<=|minati|<=|Tunnel|<=|h|<== From PSN
   |   |   |y|  |     |  |on    |  |      |  |y|
   | C |   +-+  +-----+  +------+  +------+  +-+
   | E |   |                                   |
   |   |   +-+  +-----+  +------+  +------+  +-+
   |   |   |P|  |     |  |PW ter|  | PSN  |  |P|
   |   |==>|h|=>| NSP |=>|minati|=>|Tunnel|=>|h|==> To PSN
   |   |   |y|  |     |  |on    |  |      |  |y|
   +---+   +-+  +-----+  +------+  +------+  +-+
           |                                   |
           +-----------------------------------+
                   ^        ^          ^
                   |        |          |
                   A        B          C

           Figure 3: PW reference diagram

   The PW terminates at a logical port within the PE, defined at point B
   in the above diagram. This port provides an Ethernet MAC service that
   will deliver each Ethernet frame that is received at point A,
   unaltered, to the point A in the corresponding PE at the other end of
   the PW.

   The Native Service Processing (NSP) function includes frame
   processing that is required for the Ethernet frames that are
   forwarded to the PW termination point. Such functions may include
   stripping, overwriting or adding VLAN tags, physical port
   multiplexing and demultiplexing, PW-PW bridging, L2 encapsulation,
   shaping, policing, etc. These functions are specific to the ethernet



Martini, et al.                                                 [Page 5]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


   technology , and may not be required for the PW emulation service.

   The points to the left of A, including the physical layer between the
   CE and PE, and any adaptation (NSP) functions between it and the PW
   terminations, are outside of the scope of PWE3 and are not defined
   here.

   "PW Termination", between A and B, represents the operations for
   setting up and maintaining the PW, and for encapsulating and
   decapsulating the Ethernet frames as necessary to transmit them
   across the MPLS network.

   An Ethernet PW operates in one of two modes: "raw mode" or "tagged
   mode". In tagged mode, each frame MUST contain at least one 802.1Q
   [802.1Q] VLAN tag, and the tag value is meaningful to the NSPs at the
   two PW termination points. That is, the two PW termination points
   must have some agreement (signaled or manually configured) on how to
   process the tag. On a raw mode PW, a frame MAY contain an 802.1Q VLAN
   tag, but if it does, the tag is not meaningful to the NSPs, and
   passes transparently through them.


3. Applicability Statement

   The Ethernet PW emulation allows a service provider to offer a "port
   to port" Ethernet based service across an MPLS packet switched
   network (PSN) while the Ethernet VLAN PW emulation allows an
   "Ethernet VLAN to VLAN" based service across an MPLS packet switched
   network (PSN).

   The Ethernet or Ethernet VLAN PW has the following characteristics in
   relationship to the respective native service:

     - Ethernet PW connects two Ethernet ACs while Ethernet VLAN PW
       connects two Ethernet VLAN ACs, supporting bi-directional
       transport of variable length Ethernet frames. The ingress Native
       Service Processing (NSP) function strips the preamble and FCS
       from the Ethernet frame and transports the frame in its entirety
       across the PW. This is done regardless of the presence of the
       802.1Q tag in the frame. The egress NSP function receives the
       Ethernet frame from the PW and regenerates the preamble or FCS
       before forwarding the frame to the attachment circuit. Since FCS
       is not being transported across either Ethernet or Ethernet VLAN
       PWs, payload integrity transparency may be lost.  The OPTIONAL
       methods described in [FCS] can be used to achieve payload
       integrity transparency on Ethernet or Ethernet VLAN PWs.





Martini, et al.                                                 [Page 6]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


     - For Ethernet VLAN PW, VLAN tag rewrite can be achieved by NSP at
       the egress PE which is outside the scope of this document.

     - The Ethernet or Ethernet VLAN PW only supports homogeneous
       Ethernet frame type across the PW; both ends of the PW must be
       either tagged or untagged.  Heterogeneous frame type support
       achieved with NSP functionality is outside the scope of this
       document.

     - Ethernet port or Ethernet VLAN status notification is provided
       using the PW Status TLV in the LDP status notification message.
       Loss of connectivity between PEs can be detected by the LDP
       session closing, or by using [VCCV] mechanisms.  The PE can
       convey these indications back to its attached Remote System.

     - The maximum frame size that can be supported is limited by the
       PSN MTU minus the MPLS header size, unless fragmentation and
       reassembly is used [FRAG].

     - The packet switched network may reorder, duplicate, or silently
       drop packets. Sequencing MAY be enabled in the Ethernet or
       Ethernet VLAN PW to detect lost, duplicate, or out-of-order
       packets on a per-PW basis.

     - The faithfulness of an Ethernet or Ethernet VLAN PW may be
       increased by leveraging Quality of Service features of the PEs
       and the underlying PSN. (see "QoS Considerations" section)


4. Details Specific to Particular Emulated Services

4.1. Ethernet Tagged Mode

   The Ethernet frame will be encapsulated according to the procedures
   defined later in this document for tagged mode. It should be noted
   that if the VLAN identifier is modified by the egress PE, the
   Ethernet spanning tree protocol might fail to work properly. If this
   issue is of significance, the VLAN identifier MUST be selected in
   such away that it matches on the Attachment Circuits at both ends of
   the PW.

   If the PE detects a failure on the Ethernet physical port, or the
   port is administratively disabled, it MUST send PW status
   notification message for all PWs associated with the port.

   This mode uses service-delimiting tags to map input Ethernet frames
   to respective PWs and is corresponds to PW type 0x0004 "Ethernet
   Tagged Mode" [IANA].



Martini, et al.                                                 [Page 7]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


4.2. Ethernet Raw Mode

   The Ethernet frame will be encapsulated according to the procedures
   defined later in this document for raw mode. If the PE detects a
   failure on the Ethernet input port, or the port is administratively
   disabled, the PE MUST send an appropriate PW status notification
   message to the corresponding remote PE.

   In this mode all Ethernet frames received on the attachment circuit
   of PE1 will be transmitted to PE2 on a single PW. This service
   corresponds to PW type 0x0005 "Ethernet" [IANA].


4.3. Ethernet Specific Interface Parameter LDP Sub-TLV

   This LDP sub-Type Length Value [LDP] specifies interface specific
   parameters. When applicable, it MUST be used to validate that the
   PEs, and the ingress and egress ports at the edges of the circuit,
   have the necessary capabilities to interoperate with each other. The
   Interface parameter TLV is defined in [PWE3-CTRL], the IANA registry
   with initial values for interface parameter sub-TLV types is defined
   in [IANA], but the Ethernet specific interface parameters are
   specified as follows:
     - 0x06 Requested VLAN ID Sub-TLV

       An Optional 16 bit value indicating the requested VLAN ID. This
       parameter MUST be used by a PE that is incapable of rewriting the
       802.1Q Ethernet VLAN tag on output. If the ingress PE receives
       this request, it MUST rewrite the VLAN ID contained inside the
       VLAN Tag at the input to match the requested VLAN ID. If this is
       not possible, and the VLAN ID does not already match the
       configured ingress VLAN ID, the PW MUST not be enabled. This
       parameter is applicable only to PW type 0x0004.


4.4. Generic Procedures

   When the NSP/Forwarder hands a frame to the PW termination function:

     - The preamble (if any) and FCS are stripped off.

     - The control word as defined in the "The Control Word" section is,
       if necessary, prepended to the resulting frame. The conditions
       under which the control word is or is not used are specified
       below.






Martini, et al.                                                 [Page 8]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


     - The proper Pseudowire demultiplexor ( PW Label ) is prepended to
       the resulting packet.

     - The proper tunnel encapsulation is prepended to the resulting
       packet.

     - The packet is transmitted.

   The way in which the proper tunnel encapsulation and pseudo wire
   demultiplexor are chosen depends on the procedures that were used to
   set up the pseudo wire.

   The tunnel encapsulation depends on how the MPLS PSN is setup. This
   can include no label, one label or more labels. The proper pseudo
   wire demultiplexor is an MPLS label whose value is determined by the
   PW setup and maintenance protocols.

   When a packet arrives over a PW, the tunnel encapsulation and PW
   demultiplexor are stripped off. If the control word is present, it is
   processed and stripped off. The resulting frame is then handed to the
   Forwarder/NSP. Regeneration of the FCS is considered to be an NSP
   responsibility.


4.4.1. Raw Mode vs. Tagged Mode

   When the PE receives an Ethernet frame, and the frame has a VLAN tag,
   we can distinguish two cases:

      1. The tag is "service-delimiting". This means that the tag was
         placed on the frame by some piece of service provider-operated
         equipment, and the tag is used by the service provider to
         distinguish the traffic. For example, LANs from different
         customers might be attached to the same service provider
         switch, which applies VLAN tags to distinguish one customer's
         traffic from another's, and then forwards the frames to the PE.

      2. The tag is not service-delimiting. This means that the tag was
         placed in the frame by a piece of customer equipment, and is
         not meaningful to the PE.

   Whether the tag is service delimiting or not , is determined by local
   configuration on the PE.

   If an Ethernet PW is operating in raw mode, service-delimiting tags
   are NEVER sent over the PW. If a service-delimiting tag is present
   when the frame is received from attachment circuit by the PE, it MUST
   be stripped (by the NSP) from the frame before the frame is sent to



Martini, et al.                                                 [Page 9]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


   the PW.

   If an Ethernet PW is operating in tagged mode, every frame sent on
   the PW MUST have a service-delimiting VLAN tag. If the frame as
   received by the PE from the attachment circuit does not have a
   service-delimiting VLAN tag, the PE must prepend the frame with a
   dummy VLAN tag before sending the frame on the PW. This is the
   default operating mode. This is the only REQUIRED mode.

   In both modes, non-service-delimiting tags are passed transparently
   across the PW as part of the payload. It should be noted that a
   single Ethernet packet may contain more then one tag. At most one of
   these tags may be service-delimiting. In any case the NSP function
   may only inspect the outer most tag for the purpose of adapting the
   Ethernet frame to the pseudo wire.

   In both modes, the service-delimiting tag values have only local
   significance, i.e., are meaningful only at a particular PE-CE
   interface.  When tagged mode is used, the PE that receives a frame
   from the PW may rewrite the tag value, or may strip the tag entirely,
   or may leave the tag unchanged, depending on its configuration. When
   raw mode is used, the PE that receives a frame may or may not need to
   add a service-delimiting tag before transmitting the frame on the
   attachment circuit; however it MUST not rewrite or remove any tags
   which are already present.

   The following table illustrates the what operations might be
   performed at input from the attachment circuit:

   +-----------------------------------------------------------+
   |       Tag-> |  service delimiting | non service delimiting|
   |--------+---------------------+----------------------------|
   |   Raw Mode  | 1st VLAN Tag Removed| no operation performed|
   |--------+---------------------+----------------------------|
   | Tagged Mode | NO OP or Tag Added  |     Tag Added         |
   +-----------------------------------------------------------+



4.4.2. MTU Management on the PE/CE Links

   The Ethernet PW MUST NOT be enabled unless it is known that the MTUs
   of the CE-PE links are the same at both ends of the PW. If an egress
   router receives an encapsulated layer 2 PDU whose payload length
   (i.e., the length of the PDU itself without any of the encapsulation
   headers), exceeds the MTU of the destination layer 2 interface, the
   PDU MUST be dropped.




Martini, et al.                                                [Page 10]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


4.4.3. Frame Ordering

   In general, applications running over Ethernet do not require strict
   frame ordering. However the IEEE definition of 802.3 [802.3] requires
   that frames from the same conversation in the context of link
   aggregation (clause 43) are delivered in sequence. Moreover, the PSN
   cannot (in the general case) be assumed to provide or to guarantee
   frame ordering. An Ethernet PW can, through use of the control word,
   provide strict frame ordering. If this option is enabled, any frames
   which get mis-ordered by the PSN will be dropped or reordered by the
   receiving PW endpoint. If strict frame ordering is a requirement for
   a particular PW, this option MUST be enabled.


4.4.4. Frame Error Processing

   An encapsulated Ethernet frame traversing a pseudo wire may be
   dropped, corrupted or delivered out-of-order. As described in [PWE3-
   REQ], frame-loss, corruption, and out-of-order delivery is considered
   to be a "generalized bit error" of the pseudo wire. PW frames that
   are corrupted will be detected at the PSN layer and dropped.

   At the ingress of the PW the native Ethernet frame error processing
   mechanisms MUST be enabled. Therefore, if a PE device receives an
   Ethernet frame containing hardware level CRC errors, framing errors,
   or a runt condition, the frame MUST be discarded on input. Note that
   defining this processing is part of the NSP function and is outside
   the scope of this document.


4.4.5. IEEE 802.3x Flow Control Interworking

   In a standard Ethernet network, the flow control mechanism is
   optional and typically configured between the two nodes on a point-
   to-point link (e.g.  between the CE and the PE). IEEE 802.3x PAUSE
   frames MUST NOT be carried across the PW. See Appendix A for notes on
   CE-PE flow control.


4.5. Management

   The Ethernet PW management model follows the general management
   defined in [RFC3985] and [PWE3-MIB]. Many common PW management
   facilities are provided here, with no additional Ethernet specifics
   necessary.  Ethernet-specific parameters are defined in an additional
   MIB module, [PW-MIB].





Martini, et al.                                                [Page 11]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


4.6. The Control Word

   When carrying Ethernet over an MPLS backbone, sequentiality may need
   to be preserved. The OPTIONAL control word along the guidelines of
   [PWE3-CW] is defined here, and addresses this requirement.
   Implementations MUST support sending no control word, and MAY support
   sending a control word. If the control word is not used all the
   functionality defined in [PWE3-CW] is not available. In particular
   the PW packet may be mistakenly recognized as an IP packet by PSN
   devices that use the first nibble in the packet to identify it's
   content. This problem is only significant if the PSN contain equal
   cost load sharing links, and a source MAC address starting with 0x4
   as it first byte is used.

   A PW carried over an MPLS PSN that uses the contents of the MPLS
   payload to select the ECMP path SHOULD employ the PW MPLS Control
   Word, if strict packet ordering is required.

   In all cases the egress router must be aware of whether the ingress
   router will send a control word over a specific virtual circuit. This
   may be achieved by configuration of the routers, or by signaling, as
   defined in [PWE3-CTRL].

   The control word is defined as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0|   Reserved            |       Sequence Number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   In the above diagram the first 4 bits MUST be set to 0 to indicate PW
   data.  The rest of the first 16 bits are reserved for future use.
   They MUST be set to 0 when transmitting, and MUST be ignored upon
   receipt.

   The next 16 bits provide a sequence number that can be used to
   guarantee ordered frame delivery. The processing of the sequence
   number field is OPTIONAL.

   The sequence number space is a 16 bit, unsigned circular space. The
   sequence number value 0 is used to indicate that the sequence number
   check algorithm is not used. The sequence number processing algorithm
   is found in [PWE3-CW].







Martini, et al.                                                [Page 12]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


4.7. QoS Considerations

   The ingress PE MAY consider the user priority (PRI) field [802.1Q] of
   the VLAN tag header when determining the value to be placed in a QoS
   field of the encapsulating protocol (e.g., the EXP fields of the MPLS
   label stack).  In a similar way, the egress PE MAY consider the QoS
   field of the MPLS (e.g., the EXP fields of the MPLS label stack)
   protocol when queuing the frame for CE-bound.

   A PE MUST support the ability to carry the Ethernet PW as a best
   effort service over the MPLS PSN. PRI bits are kept transparent
   between PE devices, regardless of the QoS support of the PSN.

   If an 802.1Q VLAN field is added at the PE, a default PRI setting of
   zero MUST be supported, a configured default value is recommended, or
   the value may be mapped from the QoS field of the PSN, as referred to
   above.

   A PE may support additional QoS support by means of one or more of
   the following methods:

        -i. One COS per PW End Service (PWES), mapped to a single COS PW
            at the PSN.
       -ii. Multiple COS per PWES mapped to a single PW with multiple
            COS at the PSN.
      -iii. Multiple COS per PWES mapped to multiple PWs at the PSN.

   Examples of the cases above and details of the service mapping
   considerations are described in Appendix B.

   The PW guaranteed rate at the MPLS PSN level is PW service provider
   policy based on agreement with the customer, and may be different
   from the Ethernet physical port rate.


5. Security Considerations

   The Ethernet pseudo wire type is subject to all of the general
   security considerations discussed in [RFC3985][PWE3-CTRL].

   The Ethernet pseudo wire is transported on a MPLS PSN, therefore the
   security of the pseudo wire itself will only be as good as the
   security of the MPLS PSN. The MPLS PSN can be secured by various
   methods, as described in [MPLS-ARCH].

   Security achieved by access control of MAC addresses is out of scope
   of this document. Additional security requirements related to the use
   of PW in a switching (virtual bridging) environment are not discussed



Martini, et al.                                                [Page 13]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


   here as they are not within the scope of this document.


6. PSN MTU Requirements

   The MPLS PSN MUST be configured with an MTU that is large enough to
   transport a maximum sized Ethernet frame which has been encapsulated
   with a control word, a pseudo wire demultiplexor, and a tunnel
   encapsulation. With MPLS used as the tunneling protocol, for example,
   this is likely to be 8 or more bytes greater than the largest frame
   size. The methodology described in [FRAG] MAY be used to fragment
   encapsulated frames that exceed the PSN MTU.  However if [FRAG] is
   not used and if the ingress router determines that an encapsulated
   layer 2 PDU exceeds the MTU of the PSN tunnel through which it must
   be sent, the PDU MUST be dropped.


7. IANA Considerations

   This document has no IANA Actions.


8. Full Copyright Statement

   Copyright (C) The Internet Society (2005).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


9. Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be



Martini, et al.                                                [Page 14]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at ietf-
   ipr@ietf.org.


10. Normative References

   [PWE3-CW] "PWE3 Control Word for use over an MPLS PSN", S. Bryant,
        G. Swallow, D. McPherson, draft-ietf-pwe3-cw-01.txt, ( work in
        progress ), December 2004.

   [IANA] "IANA Allocations for pseudo Wire Edge to Edge Emulation
        (PWE3)" Martini,Townsley, draft-ietf-pwe3-iana-allocation-08.txt
        (work in progress), April 2004

   [PWE3-CTRL] "Transport of Layer 2 Frames Over MPLS", Martini L.,et al
        draft-ietf-pwe3-control-protocol-09.txt, ( work in progress ),
        September 2004.

   [MPLS-ARCH] RFC3031, "Multiprotocol Label Switching Architecture."
         E. Rosen, A. Viswanathan, R. Callon. January 2001.

   [802.3] IEEE802.3-2005, ISO/IEC 8802-3: 2000 (E), "IEEE Standard
        for Information technology -- Telecommunications and
        information exchange between systems -- Local and metropolitan
         area networks -- Specific requirements -- Part 3: Carrier
        Sense Multiple Access with Collision Detection (CSMA/CD)
        Access Method and Physical Layer Specifications", 2005.

   [802.1Q] ANSI/IEEE Standard 802.1Q-2005, "IEEE Standards for
        Local and Metropolitan Area Networks: Virtual Bridged
        Local Area Networks", 2005.

   [PDU] IEEE Std 802.3, 1998 Edition, "Part 3: Carrier
        sense multiple access with collision detection (CSMA/CD)
        access method and physical layer specifications" figure 3.1,
        1998



Martini, et al.                                                [Page 15]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


11. Informative References

   [RFC3985] RFC3985, "PWE3 Architecture" Bryant, et al., RFC3985.

   [PWE3-REQ] "Requirements for Pseudo Wire Emulation Edge-to-Edge",
        Xiao, X., McPherson, D., Pate, P., White, C., Kompella,
        K., Gill,  V., Nadeau, T., draft-ietf-pwe3-requirements-08.txt,
        (work in progress), September 2003.

   [PWE3-MIB] "Pseudo Wire (PW) Management Information Base
        using SMIv2", Zelig, D., Mantin, S., Nadeau, T., Danenberg,
        D., draft-ietf-pwe3-pw-mib-04.txt, (work in progress),
        February 2004.

   [LDP] "LDP Specification." L. Andersson, P. Doolan, N. Feldman, A.
        Fredette, B. Thomas. January 2001. RFC3036

   [FRAG] "PWE3 Fragmentation and Reassembly", A. Malis, W. M. Townsley,
        draft-ietf-pwe3-fragmentation-08.txt ( work in progress )
        February 2005

   [FCS] "PWE3 Frame Check Sequence Retention", A. Malis, D.Allan,
        N. Del Regno, draft-ietf-pwe3-fcs-retention-04.txt (work in
        progress) September 2005


12. Editor Information


   Luca Martini
   Cisco Systems, Inc.
   9155 East Nichols Avenue, Suite 400
   Englewood, CO, 80112
   e-mail: lmartini@cisco.com



13. Author Information


   Nasser El-Aawar
   Level 3 Communications, LLC.
   1025 Eldorado Blvd.
   Broomfield, CO, 80021
   e-mail: nna@level3.net






Martini, et al.                                                [Page 16]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005



   Giles Heron
   Tellabs
   Abbey Place
   24-28 Easton Street
   High Wycombe
   Bucks
   HP11 1NT
   UK
   e-mail: giles.heron@tellabs.com


   Eric C. Rosen
   Cisco Systems, Inc.
   1414 Massachusetts Avenue
   Boxborough, MA 01719
   e-mail: erosen@cisco.com



14. Significant Contributors


   Andrew G. Malis
   Tellabs
   90 Rio Robles Dr.
   San Jose, CA 95134
   e-mail: Andy.Malis@tellabs.com


   Dan Tappan
   Cisco Systems, Inc.
   1414 Massachusetts Avenue
   Boxborough, MA 01719
   e-mail: tappan@cisco.com


   Steve Vogelsang
   ECI Telecom
   Omega Corporate Center
   1300 Omega Drive
   Pittsburgh, PA 15205
   e-mail: stephen.vogelsang@ecitele.com








Martini, et al.                                                [Page 17]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005



   Vinai Sirkay
   Reliance Infocomm
   Dhirubai Ambani Knowledge City
   Navi Mumbai 400 709
   India
   e-mail: vinai@sirkay.com


   Vasile Radoaca
   Nortel Networks
   600  Technology Park
   Billerica MA 01821
   e-mail: vasile@nortelnetworks.com


   Chris Liljenstolpe
   Alcatel
   11600 Sallie Mae Dr.
   9th Floor
   Reston, VA 20193
   e-mail: chris.liljenstolpe@alcatel.com


   Kireeti Kompella
   Juniper Networks
   1194 N. Mathilda Ave
   Sunnyvale, CA 94089
   e-mail: kireeti@juniper.net


   Tricci So
   Nortel Networks 3500 Carling Ave.,
   Nepean, Ontario,
   Canada, K2H 8E9.
   e-mail: tso@nortelnetworks.com


   XiPeng Xiao
   Riverstone Networks
   5200 Great America Parkway
   Santa Clara, CA 95054
   e-mail: xxiao@riverstonenet.com








Martini, et al.                                                [Page 18]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005



   Christopher O.  Flores
   T-Systems
   10700 Parkridge Boulevard
   Reston, VA 20191
   USA
   e-mail: christopher.flores@usa.telekom.de


   David Zelig
   Corrigent Systems
   126, Yigal Alon St.
   Tel Aviv, ISRAEL
   e-mail: davidz@corrigent.com


   Raj Sharma
   Luminous Netwokrs, Inc.
   10460 Bubb Road
   Cupertino, CA 95014
   e-mail: raj@luminous.com


   Nick Tingle
   TiMetra Networks
   274 Ferguson Drive
   Mountain View, CA 94043
   e-mail: nick@timetra.com


   Sunil Khandekar
   TiMetra Networks
   274 Ferguson Drive
   Mountain View, CA 94043
   email: sunil@timetra.com


   Loa Andersson
   TLA-group
   e-mail: loa@pi.se











Martini, et al.                                                [Page 19]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


Ap A Interoperability Guidelines

Configuration Options

   The following is a list of the configuration options for a point-to-
   point Ethernet PW based on the reference points of Figure 3:

   --------------|---------------|---------------|------------------
   Service and   |  Encap on C   |Operation at B | Remarks
   Encap on A    |               |ingress/egress |
   --------------|---------------|---------------|------------------
   1) Raw        | Raw - Same as |               |
                 | A             |               |
                 |               |               |
   --------------|---------------|---------------|------------------
   2) Tag1       | Tag2          |Optional change| VLAN can be
                 |               |of VLAN value  | 0-4095
                 |               |               | Change allowed in
                 |               |               | both directions
   --------------|---------------|---------------|------------------
   3) No Tag     | Tag           |Add/remove Tag | Tag can be
                 |               |field          | 0-4095
                 |               |               | (note i)
                 |               |               |
   --------------|---------------|---------------|------------------
   4) Tag        | No Tag        |Remove/add Tag | (note ii)
                 |               |field          |
                 |               |               |
                 |               |               |
   --------------|---------------|---------------|------------------

                Figure 4: Configuration Options

   Allowed combinations:

   Raw and other services are not allowed on the same NSP virtual port
   (A). All other combinations are allowed, except that conflicting
   VLANs on (A) are not allowed. Note that in most point-to-point PW
   application the NSP virtual port is the same entity as the physical
   port.

   Notes:

        -i. Mode #3 MAY be limited to adding VLAN NULL only, since
            change of VLAN or association to specific VLAN can be done
            at the PW CE-bound side.





Martini, et al.                                                [Page 20]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


       -ii. Mode #4 exists in layer 2 switches, but is not recommended
            when operating with PW since it may not preserve the user's
            PRI bits.  If there is a need to remove the VLAN tag (for
            TLS at the other end of the PW) it is recommended to use
            mode #2 with tag2=0 (NULL VLAN) on the PW and use mode #3 at
            the other end of the PW.


IEEE 802.3x Flow Control Considerations

   If the receiving node becomes congested, it can send a special frame,
   called the PAUSE frame, to the source node at the opposite end of the
   connection.  The implementation MUST provide a mechanism for
   terminating PAUSE frames locally (i.e. at the local PE). It MUST
   operate as follows: PAUSE frames received on a local Ethernet port
   SHOULD cause the PE device to buffer, or to discard, further Ethernet
   frames for that port until the PAUSE condition is cleared.
   Optionally, the PE MAY simply discard PAUSE frames.

   If the PE device wishes to pause data received on a local Ethernet
   port (perhaps because its own buffers are filling up or because it
   has received notification of congestion within the PSN) then it MAY
   issue a PAUSE frame on the local Ethernet port, but MUST clear this
   condition when willing to receive more data.


Ap B QoS Details

   Section 3.7 describes various modes for supporting PW QOS over the
   PSN.  Examples of the above for a point to point VLAN service are:

     - The classification to the PW is based on VLAN field only,
       regardless of the user PRI bits.  The PW is assigned a specific
       COS (marking, scheduling, etc.)  at the tunnel level.

     - The classification to the PW is based on VLAN field, but the PRI
       bits of the user is mapped to different COS marking (and network
       behavior) at the PW level.  Examples are and E-LSP in an MPLS
       network.

     - The classification to the PW is based on VLAN field and the PRI
       bits, and frames with different PRI bits are mapped to different
       PWs. An example is to map a PWES to different L-LSPs in MPLS PSN
       in order to support multiple COS over an L-LSP capable network,
       or to multiple L2TPv3 sessions [L2TPv3].

       The specific value to be assigned at the PSN for various COS is
       out of scope for this document.



Martini, et al.                                                [Page 21]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


Adaptation of 802.1Q COS to PSN COS

   It is not required that the PSN will have the same COS definition of
   COS as defined in [802.1Q], and the mapping of 802.1Q COS to PSN COS
   is application specific and depends on the agreement between the
   customer and the PW provider.  However, the following principles
   adopted from 802.1Q table 8-2 MUST be met when applying set of PSN
   COS based on user's PRI bits.

                ----------------------------------
                |#of available classes of service|
   -------------||---+---+---+---+---+---+---+---|
   User         || 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
   Priority     ||   |   |   |   |   |   |   |   |
   ===============================================
   0 Best Effort|| 0 | 0 | 0 | 1 | 1 | 1 | 1 | 2 |
   (Default)    ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   1 Background || 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
                ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   2 Spare      || 0 | 0 | 0 | 0 | 0 | 0 | 0 | 1 |
                ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   3 Excellent  || 0 | 0 | 0 | 1 | 1 | 2 | 2 | 3 |
   Effort       ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   4 Controlled || 0 | 1 | 1 | 2 | 2 | 3 | 3 | 4 |
   Load         ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   5 Interactive|| 0 | 1 | 1 | 2 | 3 | 4 | 4 | 5 |
   Multimedia   ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   6 Interactive|| 0 | 1 | 2 | 3 | 4 | 5 | 5 | 6 |
   Voice        ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   7 Network    || 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 |
   Control      ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|

                Figure 5: IEEE 802.1Q COS Service Mapping










Martini, et al.                                                [Page 22]

Internet Draft   draft-ietf-pwe3-ethernet-encap-11.txt     November 2005


Drop precedence

   The 802.1P standard does not support drop precedence, therefore from
   the PW PE-bound point of view there is no mapping required.  It is
   however possible to mark different drop precedence for different PW
   frames based on the operator policy and required network behavior.
   This functionality is not discussed further here.

   PSN QOS support and signaling of QOS is out of scope of this
   document.









































Martini, et al.                                                [Page 23]

